const mappings = {
    "А": "A",
    "а": "a",
    "Ә": "Ä",
    "ә": "ä",
    "Б": "B",
    "б": "b",
    "В": "V",
    "в": "v",
    "Г": "G",
    "г": "g",
    "Ғ": "Ğ",
    "ғ": "ğ",
    "Д": "D",
    "д": "d",

    "Е": "E",
    "е": "e",
    "Ё": "E",
    "ё": "e",
    "Ж": "J",
    "ж": "j",
    "З": "Z",
    "з": "z",
    "Й": "İ",
    "й": "i",
    "К": "K",
    "к": "k",

    "Қ": "Q",
    "қ": "q",
    "Л": "L",
    "л": "l",
    "М": "M",
    "м": "m",
    "Н": "N",
    "н": "n",
    "Ң": "Ñ",
    "ң": "ñ",
    "О": "O",
    "о": "o",
    "Ө": "Ö",
    "ө": "ö",

    "П": "P",
    "п": "p",
    "Р": "R",
    "р": "r",
    "С": "S",
    "с": "s",
    "Т": "T",
    "т": "t",


    "Ұ": "U",
    "ұ": "u",
    "ү": "Ü",
    "ү": "ü",

    "Ф": "F",
    "ф": "f",
    "Х": "H",
    "х": "h",
    "Һ": "H",
    "һ": "h",
    "Ц": "S",
    "ц": "s",
    "Ч": "C",
    "ч": "c",
    "Ш": "C",
    "ш": "c",
    "Щ": "C",
    "щ": "c",

    "Ы": "I",
    "ы": "ı",
    "І": "İ",
    "і": "i",
    "Э": "E",
    "э": "e",
    "Ь": "",
    "ь": "",
    "Ъ": "",
    "ъ": "",
}

const snowflakes = {
    "И": "İ",
    "и": "i",
    "У": "U",
    "у": "u",
    "Ю": "Yu",
    "ю": "yu",
    "Я": "Ya",
    "я": "ya",
}

export default function transliterate(cyrillic) {
    let result = ""
    for (let i = 0; i < cyrillic.length; i++) {
        let current = cyrillic[i]
        if (current in mappings) {

        } else if (current in snowflakes) {

        } else {
            result += current
        }
    }
    return result
}
